**Exercice 1 :**    
- Écrivez un programme Pandas pour détecter les valeurs manquantes d'un DataFrame donné.
- Afficher Vrai ou Faux.

In [ ]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', None)
df = pd.DataFrame({
'display.max_rows':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})

In [6]:
#solution
print(df.head())

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0  70001.0     150.50  2012-10-05         3002       5002.0
1      NaN     270.65  2012-09-10         3001       5003.0
2  70002.0      65.26         NaN         3001       5001.0
3  70004.0     110.50  2012-08-17         3003          NaN
4      NaN     948.50  2012-09-10         3002       5002.0

In [14]:
print(df['ord_no'].isnull())

0     False
1      True
2     False
3     False
4      True
5     False
6      True
7     False
8     False
9     False
10     True
11    False
Name: ord_no, dtype: bool

In [20]:
print(df.isnull().sum())

ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

In [21]:
# des valeurs manquantes?
print(df.isnull().values.any())

True

In [22]:
# Nombre total de valeurs manquantes
print(df.isnull().sum().sum())

8

In [27]:
df['ord_no'].fillna(125, inplace=True)
print(df.head())

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0  70001.0     150.50  2012-10-05         3002       5002.0
1    125.0     270.65  2012-09-10         3001       5003.0
2  70002.0      65.26         NaN         3001       5001.0
3  70004.0     110.50  2012-08-17         3003          NaN
4    125.0     948.50  2012-09-10         3002       5002.0

**Exercice 2 :**

- Écrivez un programme Pandas pour identifier la ou les colonnes de DataFrame  qui ont au moins une valeur manquante.

In [ ]:
#solution 
missing_values = ["n/a", "na", "--"]
df = pd.DataFrame("ord_no", na_values = missing_values)

**Exercice 3 :**   
- Écrivez un programme Pandas pour compter le nombre de valeurs manquantes dans chaque colonne d'un DataFrame.

In [28]:
#solution
print(df.isna())

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1    False      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4    False      False     False        False        False
5    False      False     False        False        False
6    False      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10   False      False     False        False        False
11   False      False     False        False         True

**Exercice 4 :**     
- Écrivez un programme Pandas pour rechercher et remplacer les valeurs manquantes dans un DataFrame  qui ne contiennent aucune information précieuse.

In [29]:
#solution

print(df.fillna(0))

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1     125.0     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26           0         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          0.0
4     125.0     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6     125.0    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          0.0
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10    125.0      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          0.0

**Exercice 5:**   
- Écrivez un programme Pandas pour supprimer les lignes où au moins un élément manque dans un DataFrame.

In [31]:
#solution
df.drop(7,0,inplace=True)

<ipython-input-31-abb0920ef5ed>:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df.drop(7,0,inplace=True)

**Exercice 6:**

- Écrivez un programme Pandas pour supprimer les colonnes où au moins un élément manque dans un DataFrame.

In [32]:
#solution
del df['ord_date']

**Exercice 7:**
- Écrivez un programme Pandas pour supprimer les lignes où tous les éléments manquent dans un DataFrame .

In [ ]:
#solution
 df.drop([1,5,7,9],0,inplace=True)

**Exercice 8:**
- Écrivez un programme Pandas pour conserver les lignes avec au moins 2 valeurs NaN dans un DataFrame.

In [ ]:
#solution
DataFrame.dropna()

**Exercice 9:**
- Écrivez un programme Pandas pour supprimer ces lignes d'un DataFrame dans lequel des colonnes spécifiques ont des valeurs manquantes.

In [ ]:
#solution
df.drop([2], 0, inplace=True)

**Exercice 10:**
- Écrivez un programme Pandas pour conserver les entrées valides d'un DataFrame.

In [34]:
#solution
	
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11 entries, 0 to 11
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ord_no       11 non-null     float64
 1   purch_amt    11 non-null     float64
 2   customer_id  11 non-null     int64
 3   salesman_id  9 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 440.0 bytes

**Exercice 11 :**
- Écrivez un programme Pandas pour calculer le nombre total de valeurs manquantes dans un DataFrame.

In [35]:
#solution
print(df.isnull().sum(axis=1))

0     0
1     0
2     0
3     1
4     0
5     0
6     0
8     0
9     0
10    0
11    1
dtype: int64

**Exercice 12:**
- Écrivez un programme Pandas pour remplacer NaNs par une seule valeur constante dans des colonnes spécifiées dans un DataFrame.

In [36]:
#solution
df.replace()

     ord_no  purch_amt  customer_id  salesman_id
0   70001.0     150.50         3002       5002.0
1     125.0     270.65         3001       5003.0
2   70002.0      65.26         3001       5001.0
3   70004.0     110.50         3003       5001.0
4     125.0     948.50         3002       5002.0
5   70005.0    2400.60         3001       5001.0
6     125.0    5760.00         3001       5001.0
8   70003.0    2480.40         3003       5003.0
9   70012.0     250.45         3002       5002.0
10    125.0      75.29         3001       5003.0
11  70013.0    3045.60         3001       5003.0

**Exercice 13:**
- Écrivez un programme Pandas pour remplacer NaNs par la valeur de la ligne précédente ou de la ligne suivante dans un DataFrame.

In [37]:
#solution
df.sort_values

<bound method DataFrame.sort_values of      ord_no  purch_amt  customer_id  salesman_id
0   70001.0     150.50         3002       5002.0
1     125.0     270.65         3001       5003.0
2   70002.0      65.26         3001       5001.0
3   70004.0     110.50         3003          NaN
4     125.0     948.50         3002       5002.0
5   70005.0    2400.60         3001       5001.0
6     125.0    5760.00         3001       5001.0
8   70003.0    2480.40         3003       5003.0
9   70012.0     250.45         3002       5002.0
10    125.0      75.29         3001       5003.0
11  70013.0    3045.60         3001          NaN>

**Exercice 14:**
- Écrivez un programme Pandas pour remplacer les NaN par la médiane ou la moyenne des colonnes spécifiées dans un DataFrame.

In [38]:
pd.set_option('display.max_rows', None)
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,np.nan,65.26,110.5,948.5,np.nan,5760,1983.43,np.nan,250.45, 75.29,3045.6],
'sale_amt':[10.5,20.65,np.nan,11.5,98.5,np.nan,57,19.43,np.nan,25.45, 75.29,35.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})

In [39]:
#solution
df.fillna(df.mean(), inplace=True)

<ipython-input-39-e19b19b2f1b9>:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean(), inplace=True)